stress_test_results_hpa/ab_test_8.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        TornadoServer/6.4.2
Server Hostname:        127.0.0.1
Server Port:            30070

Document Path:          /
Document Length:        1837 bytes

Concurrency Level:      500
Time taken for tests:   10.003 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      111150000 bytes
HTML transferred:       91850000 bytes
Requests per second:    4998.41 [#/sec] (mean)
Time per request:       100.032 [ms] (mean)
Time per request:       0.200 [ms] (mean, across all concurrent requests)
Transfer rate:          10851.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.1      1      34
Processing:    15   98  10.3     99     173
Waiting:        2   97  10.7     98     169
Total:         36   99   8.2     99     173

Percentage of the requests served within a certain time (ms)
  50%     99
  66%    102
  75%    103
  80%    105
  90%    108
  95%    111
  98%    115
  99%    118
 100%    173 (longest request)