stress_test_results_hpa/wrk_test_7.txt
Running 1m test @ http://127.0.0.1:30070/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    99.04ms   16.87ms 281.89ms   82.06%
    Req/Sec     1.28k   150.36     2.03k    68.92%
  613297 requests in 1.00m, 1.27GB read
  Socket errors: connect 3987, read 0, write 0, timeout 0
Requests/sec:  10208.71
Transfer/sec:     21.64MB